package com.fresh.common.flt;

public class CodeTest {
    /**
     *第一: 数的表示方法: 取Long的范围：[-2^63, 2^63-1]
     *      -2^63            -2^63 + 1           -2^63 + 2        ...    -1                 0                   1               ...   2^63-2            2^63-1
     * 原码  1,000 ,,, 0000   1,111 ,,, 1111      1,111 ,,, 1110   ...    1,000 ,,, 0001     0,000 ,,, 0000      0,000 ,,, 0001  ...   0,111 ,,, 1110    0,111 ,,, 1111
     * 补码  1,000 ,,, 0000   1,000 ,,, 0001      1,000 ,,, 0010   ...    1,111 ,,, 1111     0,000 ,,, 0000      0,000 ,,, 0001  ...   0,111 ,,, 1110    0,111 ,,, 1111
     *
     *第二: 数的加减法
     *补码加减计算原理: 补码数轴滚动
     *
     *第三: 减法转化成加法
     *减去一个数 <==> 加上这个数的负数，存在一个例外情况: 当减去Long.MIN_VALUE时，Number - Long.MIN_VALUE != Number + (-Long.MIN_VALUE)
     *
     *第四: 计算一个数的负数
     *在数之前写负号。例外: 0添加负号还是0; -Long.MIN_VALUE = Long.MIN_VALUE 而不等于 2^63
     *
     *
     */



}
